/*============================================================================================================================================================================
Information
==============================================================================================================================================================================
SDK: 		v2.1.1
Toolchain:	14.2Rel1
Ninja:		v1.12.1
CMake:		v4.0.0-rc4
============================================================================================================================================================================*/



/*============================================================================================================================================================================
Includes    Libaries
============================================================================================================================================================================*/
#include    <stdio.h>
#include    "pico/stdlib.h"
#include    "hardware/pio.h"
#include    "pico/cyw43_arch.h"
#include    "hardware/uart.h"



/*============================================================================================================================================================================
Define      Variable        Value       Description
============================================================================================================================================================================*/



/*============================================================================================================================================================================
Type        Variable        Value       Description
============================================================================================================================================================================*/
// Giả dữ liệu truyền vào
float       power           =50;        // Công xuất động cơ | 0-100
bool        direct          =1;         // Hướng đi: 1 - Forward | 0 - Backward
bool        isRight         =1;         // Hướng quay: 1 - Right | 0 - Left
uint16_t    STU             =50;        // Trạng thái đặc biệt: Boot - 1 | Parking - 2 | unParking - 3.

// Giả dữ liệu cổng truyền ra
uint8_t     in1_e1          =15;        // Động cơ 1 - 1
uint8_t     in2_e1          =16;        // Động cơ 1 - 2
uint8_t     in1_e2          =17;        // Động cơ 1 - 3
uint8_t     in2_e2          =18;        // Động cơ 1 - 4
uint8_t     in1_e3          =19;        // Động cơ 1 - 5
uint8_t     in2_e3          =20;        // Động cơ 1 - 6
uint8_t     in1_e4          =21;        // Động cơ 1 - 7
uint8_t     in2_e4          =22;        // Động cơ 1 - 8

// Giả dữ liệu truyền ra



/*============================================================================================================================================================================
Main Function
============================================================================================================================================================================*/
int main()
{
    while (true)
    {
        switch (STU)
        {
        case 1:
            /* code */
            break;
        
        default:
            break;
        }
    }
}



/*============================================================================================================================================================================
Sub-Functions
============================================================================================================================================================================*/
// Chuyển đổi dữ liệu mức công xuất ra xung | 0-100 -> 0-1000
void power_to_time_working(double power, bool direct)
{
    double time_working = 0;
    time_working = power * 10;
    return time_working;
}

// Đơn động cơ
void single_1_e1(double power, bool direct)
{

    if (direct)
    {
        
    }
    else
    {
        
    }
    
}

void single_1_e2( float power, bool direct)
{
    if (direct  == 1)
    {
    // Forward
        in1_e2 = power_to_time_working(power);
        in2_e2 = 0;
    }
    else
    {
        // Backward
        in1_e2 = 0;
        in2_e2 = power_to_time_working(power);
    }
}

void single_1_e3( float power, bool direct)
    {
        if (direct == 1)
        {
            // Forward
            in1_e3 = power_to_time_working(power);
            in2_e3 = 0;
        }
        else
        {
            // Backward
            in1_e3 = 0;
            in2_e3 = power_to_time_working(power);
        }
    }


void single_1_e4( float power, bool direct)
    {
        if (direct == 1)
        {
            // Forward
            in1_e4 = power_to_time_working(power);
            in2_e4 = 0;
        }
        else
        {
            // Backward
            in1_e4 = 0;
            in2_e4 = power_to_time_working(power);
        }
    }


// Động bộ 4 động cơ
void sync_4()
{
}

// Động bộ dọc 2 động cơ
void sync_2_Vertical_R()
{
}
void sync_2_Vertical_L()
{
}

// Động bộ ngang 2 động cơ
void sync_2_Horizontal_R()
{
}
void sync_2_Horizontal_L()
{
}

// Nghịch đồng bộ 2 - 2 động cơ (Xoay)
void circular()
{
}

// Giao thức đặc biệt không qua các hàm xung
void boot()
{
}
void parking()
{
}
void unParking()
{
}
void pause()
{
}




